# AGREGAR Y BORRAR COLUMNAS DEL DATAFRAME

In [1]:
import pandas as pd

In [2]:
people = {
    "Name": ['Edward', 'Marco', 'John'],
    "Last": ['Ramírez', 'Reus', 'Doe'],
    "email": ['ed@mail.com', 'marcinho@gmail.com', 'johndoe@gmail.com']
}

In [3]:
dataframe = pd.DataFrame(people)
dataframe

     Name     Last               email
0  Edward  Ramírez         ed@mail.com
1   Marco     Reus  marcinho@gmail.com
2    John      Doe   johndoe@gmail.com

In [5]:
# combinar el nombre y el apellido
dataframe['Name'] + ' ' + dataframe['Last']

0    Edward Ramírez
1        Marco Reus
2          John Doe
dtype: object

In [6]:
dataframe['full_name'] = dataframe['Name'] + ' ' + dataframe['Last']
dataframe

     Name     Last               email       full_name
0  Edward  Ramírez         ed@mail.com  Edward Ramírez
1   Marco     Reus  marcinho@gmail.com      Marco Reus
2    John      Doe   johndoe@gmail.com        John Doe

In [8]:
# remove columns
# drop method
# What do I want to drop? I want to drop columns
dataframe.drop(columns=['Name', 'Last'], inplace=True)
dataframe

                email       full_name
0         ed@mail.com  Edward Ramírez
1  marcinho@gmail.com      Marco Reus
2   johndoe@gmail.com        John Doe

In [9]:
dataframe['full_name'].str.split()

0    [Edward, Ramírez]
1        [Marco, Reus]
2          [John, Doe]
Name: full_name, dtype: object

In [10]:
# expandir la lista para que estén en diferentes columnas
# Se usa el argumento expand
dataframe['full_name'].str.split(expand=True)

        0        1
0  Edward  Ramírez
1   Marco     Reus
2    John      Doe

In [11]:
dataframe[['first', 'last']] = dataframe['full_name'].str.split(expand=True)

In [12]:
dataframe

                email       full_name   first     last
0         ed@mail.com  Edward Ramírez  Edward  Ramírez
1  marcinho@gmail.com      Marco Reus   Marco     Reus
2   johndoe@gmail.com        John Doe    John      Doe

# AGREGAR Y BORRAR FILAS DEL DATAFRAME

In [15]:
# Single row
# append method, pasando un diccionario
dataframe.append({'first': 'Tony'}, ignore_index=True)

                email       full_name   first     last
0         ed@mail.com  Edward Ramírez  Edward  Ramírez
1  marcinho@gmail.com      Marco Reus   Marco     Reus
2   johndoe@gmail.com        John Doe    John      Doe
3                 NaN             NaN    Tony      NaN

In [16]:
# append a dataframe

people = {
    "first": ['Tony', 'Super'],
    "last": ['Stark', 'Can'],
    "email": ['iron@mail.com', 'underdog@gmail.com']
}

df2 = pd.DataFrame(people)
df2

   first   last               email
0   Tony  Stark       iron@mail.com
1  Super    Can  underdog@gmail.com

In [26]:
dataframe = dataframe.append(df2, ignore_index=True)

In [27]:
dataframe

                email       full_name   first     last
0         ed@mail.com  Edward Ramírez  Edward  Ramírez
1  marcinho@gmail.com      Marco Reus   Marco     Reus
2   johndoe@gmail.com        John Doe    John      Doe
3       iron@mail.com             NaN    Tony    Stark
4       iron@mail.com             NaN    Tony    Stark
5  underdog@gmail.com             NaN   Super      Can

In [28]:
# Borrar filas
dataframe.drop(index=[2, 5], inplace=True)
dataframe

                email       full_name   first     last
0         ed@mail.com  Edward Ramírez  Edward  Ramírez
1  marcinho@gmail.com      Marco Reus   Marco     Reus
3       iron@mail.com             NaN    Tony    Stark
4       iron@mail.com             NaN    Tony    Stark

In [29]:
# borrar las columnas que cumplan cierto filtro
filt = dataframe['last'] == 'Stark'
dataframe[filt]

           email full_name first   last
3  iron@mail.com       NaN  Tony  Stark
4  iron@mail.com       NaN  Tony  Stark

In [31]:
dataframe[filt].index

Int64Index([3, 4], dtype='int64')

In [32]:
dataframe.drop(index=dataframe[filt].index, inplace=True)
dataframe

                email       full_name   first     last
0         ed@mail.com  Edward Ramírez  Edward  Ramírez
1  marcinho@gmail.com      Marco Reus   Marco     Reus